projects/05_OpenFOAM_Source_Code_Modification/cases/sodShockTube/Allrun
#!/bin/sh
cd ${0%/*} || exit 1    # Run from this directory

# Source tutorial run functions
. $WM_PROJECT_DIR/bin/tools/RunFunctions

runApplication blockMesh
runApplication setFields
runApplication $(getApplication)
runApplication -s sample foamPostProcess -func sample
./createGraphs

#------------------------------------------------------------------------------
